{
  "backend/main.mo": "Motoko actor that exposes a public query function getBgRemoveApiKey() returning a hardcoded Remove.bg API key.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: removing user API key input from UI and updating hooks to fetch shared API key from backend.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing a 5-step passport photo workflow with upload, crop, background removal, color selection, and download capabilities.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using a warm neutral color palette for a professional photography studio aesthetic.",
  "frontend/index.html": "HTML entry point for the Passport Photo Size Maker application with root div and module script reference.",
  "frontend/src/App.tsx": "Main React application component managing the 5-step workflow state (upload, crop, background removal, color selection, download) with QueryClient provider and step navigation logic.",
  "frontend/src/components/BackgroundColorSelector.tsx": "Component for selecting and applying background colors (white, black, blue) to processed images with real-time preview, checkerboard transparency pattern, and loading states.",
  "frontend/src/components/BackgroundRemover.tsx": "Component that uses useBackgroundRemoval hook to automatically fetch API key from backend and process images via Remove.bg API with professional loading UI, error handling, and skip option.",
  "frontend/src/components/CropEditor.tsx": "Interactive image cropping component with zoom and drag controls that allows users to manually crop images to a 3.5:4.5 aspect ratio for passport photos, rendering the image and crop overlay on a canvas.",
  "frontend/src/components/DownloadControls.tsx": "Final step component that displays the processed passport photo with specifications and provides download buttons for JPG and PNG formats at 300 DPI (413×531 pixels), optionally applying background color before download.",
  "frontend/src/components/ImageUploader.tsx": "File upload component supporting drag-and-drop and file browsing for JPG, PNG, and WEBP images up to 10MB, converting selected files to data URLs for processing.",
  "frontend/src/components/Layout.tsx": "Main application layout wrapper providing header with branding, footer with social links and caffeine.ai attribution, and a container for page content.",
  "frontend/src/components/WorkflowStepper.tsx": "Progress indicator component displaying five workflow steps (upload, crop, background, color, download) with visual states for completed, current, and upcoming steps, allowing navigation to completed steps.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBackgroundRemoval.ts": "Hook that integrates with Remove.bg API to remove image backgrounds, managing processing state, error handling, and API key retrieval from backend queries.",
  "frontend/src/hooks/useCropState.ts": "Custom React hook managing crop state (x, y, zoom) with update and reset functions for image cropping interface.",
  "frontend/src/hooks/useImageUpload.ts": "Custom React hook handling image file upload with validation (JPG/PNG/WEBP, max 10MB), FileReader conversion to data URL, and error state management.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity authentication provider and hook for ICP integration, managing login/logout flow, identity persistence, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "React Query hook to fetch Remove.bg API key from backend actor with infinite cache stale time.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color palette featuring warm neutral tones and photography studio aesthetic for light and dark modes.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name composition.",
  "frontend/src/main.tsx": "Application entry point wrapping App with QueryClientProvider and InternetIdentityProvider for React Query and ICP authentication.",
  "frontend/src/utils/applyBackground.ts": "Canvas utility applying solid background color to transparent PNG images, scaling to passport photo dimensions (413x531px) while maintaining aspect ratio.",
  "frontend/src/utils/cropImage.ts": "Canvas-based image cropping utility that extracts specified crop area and scales output to passport photo dimensions (413x531px at 300 DPI).",
  "frontend/src/utils/downloadImage.ts": "Utility function converting image to JPG or PNG blob at passport photo dimensions and triggering browser download with proper filename.",
  "frontend/src/utils/imageToBlob.ts": "Converts data URLs, blob URLs, or regular URLs to Blob objects for FormData submission to Remove.bg API.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme with custom OKLCH colors, Inter font family, container settings, and animation keyframes for accordion components.",
  "project_state.json": "Project metadata documenting passport photo maker app (3.5x4.5cm at 300 DPI) with manual cropping, Remove.bg API integration, background color options, and multi-format download features."
}